%5.8-16日作业（前几天在复习考试，所以看的其他书。美赛加油！）
%------------------------------分界符----------------------------------%
%Q1

a_1=randi([100,999],1)%生成一维的在[100,999]的矩阵
b_1 = a_1-mod(floor(a_1/10),10)*10;%将十位/10转移到个位上，对10取余

%------------------------------分界符----------------------------------%
%Q2
syms x_2 y_2
x_2=(1+pi)^(1/3);
y_2=(exp(-x_2)-tand(73))/(10^(-5)+log(abs(sin(x_2)^2-sin(x_2^2))))
%注意此处tand()内输入的是度数

%------------------------------分界符----------------------------------%
%Q3
syms y_3 i_3
a_3=input('请输入a的值')
b_3=input('请输入b的值')
c_3=input('请输入c的值')
x_3=input('请输入x的值')

%下面使用if语句进行
if x_3>=0.5 && x_3<1.5
    y_3=a_3*x_3^2+b_3*x_3+c_3;

elseif x_3>=1.5 && x_3<3.5
    y_3=a_3*sin(b_3)^c_3+x_3;

elseif x_3>=3.5 && x_3<5.5
    y_3=log(abs(b_3+(c_3/x_3)));
end
disp(y_3)

%下面使用switch语句进行
% if x_3>=0.5 && x_3<1.5
%     i_3=1
% elseif x_3>=1.5 && x_3<3.5
%     i_3=2
% elseif x_3>=3.5 && x_3<5.5
%     i_3=3
% end
% switch i_3
%     case i_3==1
%         y_3=a_3*x_3^2+b_3*x_3+c_3;
% 
%     case i_3==2
%         y_3=a_3*sin(b_3)^c_3+x_3;
% 
%     case i_3==3
%         y_3=log(abs(b_3+(c_3/x_3)));
% end
% disp(y_3)

%------------------------------分界符----------------------------------%
%Q4
syms s
n_4=randi([10,99],[1,20])%返回介于1至imax之间的最大整数
mu_4=mean(n_4)
%n_4(find(n_4<mu_4&mod(n_4,2)==0)) %可以直接使用find函数进行寻找
num_1=1 %建立索引
for i_4=1:20
    if rem(n_4,2)==0 & n_4(i_4)<mu_4
        s(num_1)=n_4(i_4);
        num_1=num_1+1
    end
end
disp(s(num_1))

%------------------------------分界符----------------------------------%
%Q5
%循环结构
s_5=0; %需要先设置初始值
for i_5=0:63
    s_5=s_5+2^(i_5);
end
disp(s_5)

%sum函数进行计算
n_5=0:63; %使用向量代替循环，是MATLAB的优势所在
x_5=2.^n_5
sum_5=sum(x_5)


%------------------------------分界符----------------------------------%
%Q6
%第一小题

%向量结构
n_6_1=1:10000; %我宣布向量是yyds！
x_6_1=(-1).^(n_6_1+1).*(1./n_6_1); %记得使用矩阵时运算使用点运算
sum_6_1=sum(x_6_1)
%循环结构
s_6=0
for i_6=1:10000
    n_6=(-1)^(i_6+1)*(1/i_6);
    s_6=s_6+n_6;
end
disp(s_6)


%第二小题

%向量结构
n_6_2=1:10000;
x_6_2=(-1).^(n_6_2+1).*(1./(2*n_6_2-1));
sum(x_6_2)
%循环结构
ss_6=0
for ii=1:10000
    nn=(-1)^(ii+1)*(1/(2*ii-1));
    ss_6=ss_6+nn;
end
disp(ss_6)

%------------------------------分界符----------------------------------%
%Q7
A_7=input('输入')
Answer=myfib(A_7)
%此处myfib的文件还需要好好看看

%------------------------------分界符----------------------------------%
%Q8
% sumi(3,2)





